stress.yml
config:
  http:
    pool: 8 
  target: "http://localhost:4000"
  phases:
    - duration: 5
      arrivalRate: 10
      rampTo: 30
      name: "round 1"
    - duration: 10
      arrivalRate: 30 
      rampTo: 50
      name: "round 2"
    - duration: 10
      arrivalRate: 50  
      rampTo: 70
      name: "round 3"
  processor: "./idGenerator.js"
scenarios: 
  - flow:
    - loop: 
      - function: "generateId"
      - get: 
          url: "/restaurants/{{ id }}/"
          json:
            id: "{{ id }}" 
      count: 50
    - log: "TESTING ID: {{ id }}"